<%@ taglib prefix="sec" uri="http://www.springframework.org/security/tags" %>
<%@ taglib uri="http://www.springframework.org/tags/form" prefix="form"%>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%>
<%@page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html len="en">
<head>
    <meta http-equiv="Content-Type" content="text/html"; charset="UTF-8"/>
    <link href="/css/homepage-style.css" type="text/css" rel="stylesheet"/>
    <title>Hello World</title>
</head>
<body>

<div id = "header">
    <ul align="center">
        <li><a href = "/">Home</a></li>
        <li><a href = "/alluser">All Students</a></li>
        <li><a href="/searchuser">Search Student</a></li>
        <sec:authorize access="hasRole('SUPER_ADMIN')">
        <li><a href="/addnewuser">Add new Students</a></li>
        </sec:authorize>
        <div id = "button">
            <form:form action="/logout" method="post">
                <input type="hidden" name="${_csrf.parameterName}" value="${_csrf.token}"/>
                <input type="submit" value="Sign Out">
            </form:form>
        </div>
    </ul>

</div>
<%--<sec:authorize access="isAuthenticated()">--%>
<%--    <h2>Welcome back , <sec:authentication property="principal.name"/> </h2>--%>
<%--</sec:authorize>--%>
<div id="content">
    <div id="text">
        <h1>Персональний день відкритих дверей</h1>
    </div>
    <div id="about">
        <p>Важливим етапом у житті кожного абітурієнта є вибір професії та закладу вищої освіти. Університет Грінченка запрошує школярів та охочих батьків завітати на Онлайн-день відкритих дверей і дізнатись якомога більше інформації навіть в умовах карантину.<p>

        <h3>Ми розповімо:</h3>
        <ul>
            <li>про спеціальності та освітні програми;</li>
            <li>про Нову освітню стратегію університету;</li>
            <li>про умови та матеріально-технічне забезпечення, де готують висококваліфікованих фахівців;</li>
            <li>про можливості для студентів та дозвілля, яке допоможе розвивати світогляд і створювати найміцніші дружні зв’язки та ін.</li>
            <li>І звісно ж, у кінці онлайн-зустрічі ви зможете поставити питання.</li>
        </ul>
        <p>Онлайн-дні відкритих дверей проводяться раз на два тижні (кожен перший та третій вівторок місяця о 15:00 в Google Meets).</p>

        <p>Щоб зареєструватись, заповніть <a href="https://docs.google.com/forms/d/e/1FAIpQLScfNVjeNUnPcHNO_1yjqJhyV3BJSjYT4MtGCsCdZp3_fKLECg/viewform">гугл-форму. </a> </p>

        <p>Дедлайн реєстрації – переддень проведення відеозустрічі (понеділок 12:00). Очікуйте лист-запрошення на свою електронну адресу.<p>



        <h2>ВАЖЛИВО!</h2>

        <p>Ми дуже хочемо зробити наші дистанційні зустрічі максимально «живими», тому пропонуємо вам приєднуватися з увімкненими камерами та, за потреби, вмикати мікрофон. На початку дня відкритих дверей студенти та випускники познайомляться з вами і будуть комунікувати впродовж всього заходу. Давайте уявимо, що наше спілкування проходить офлайн і будемо дарувати один одному щирі усмішки! </p>
        <h2>Дякуємо</h2>
    </div>
    <div id= "lool"></div>
    <div id="text">
        <h1>Про гуртожитки:</h1>
    </div>
    <div id="about">
        <p>Із 2008 року в Університеті Грінченка функціонує гуртожиток для проживання студентів та співробітників. З метою збільшення кількості місць, поліпшення комфортності проживання, в 2010 році Університет облаштував нове приміщення студентського гуртожитку на базі спортивного інтернату-ліцею (бульвар Гавела Вацлава, 46).</p>

        <p>З 2019 року введено в експлуатацію Університетський гуртожиток №2 за адресою: бульвар І. Шамо, 18/2.</p>

        <p>Гуртожитки діють на основі Положення «Про гуртожитки Київського університету імені Бориса Грінченка», затвердженого Наказом ректора №430 від 21.06.2018 року</p>

        <h3>Основні завдання гуртожитку:</h3>

        <ul>
            <li> безпосереднє керівництво господарської діяльності експлуатації гуртожитку, організація побуту мешканців, дотримання санітарних та протипожежних норм мешкання, додержання встановленого порядку;</li>
            <li >здійснення поселення в гуртожиток на підставі ордера, паспорту, медичних довідок, квитанції про сплату проживання;</li>
            <li>ознайомлення мешканців при вселенні в гуртожиток з «Положенням про студентський гуртожиток», «Правилами внутрішнього розпорядку», «Правилами пожежної безпеки» та «Правилами техніки безпеки»;</li>
            <li>утримання приміщення гуртожитку у відповідності з встановленими санітарними нормами та правилами;</li>
            <li>укомплектування гуртожитку меблями, обладнанням та іншим інвентарем;
                подання заявок на ремонтні робити в гуртожитку, обладнання, інвентарю, утримання в належному стані закріпленої території та зелених насаджень;</li>
            <li>забезпечення та контроль проведення відповідних ремонтних робіт приміщень гуртожитку та території;</li>
            <li>сприяння студентській раді гуртожитку в розвитку студентського самоврядування з питань праці, побуту і відпочинку мешканців;</li>
            <li>здійснення заходів з покращення житлових і культурно-побутових умов в гуртожитку;
                своєчасне виселення студентів, які розірвали відносини з Університетом.</li>
        </ul>
    </div>
    <div id="and"> </div>
</div>



</body>
</html>